---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinePatternElement
source: html/a12a4d88-b9f2-1ca4-0f50-dba518ad3241.htm
---
# LinePatternElement Properties

The id of the assembly instance to which the element belongs.